-- ザルカバード

local M = { id = 112 }

M.routes = {
    -- テレポヴァズ
    uleg = { -- ウルガラン山脈へ
	{x=150.3,y=-37.3,z=-21},
	{x=153.3,y=-39.5}, {a="mount"},
	{x=146.4,y=-47.4,z=-16.1}, {x=137.1,y=-48.3,z=-16.4},
	{x=96.6,y=-32.2}, {x=60.1,y=8.1}, {x=25.3,y=52.4,z=-16.2},
	--
	{x=20.3,y=67.4,z=-17.9}, {x=22.8,y=108.7,z=-25.9},
	{x=14.9,y=137.3,z=-33.2}, {x=6.8,y=135.5,z=-34.8},
	{x=-7,y=69.1,z=-36.2}, {x=-24.5,y=60.4}, {x=-50.9,y=60.1},
	{x=-70,y=62.4}, {x=-85.9,y=59.2}, {x=-98.4,y=60.1},
	{x=-130.7,y=51.5}, {x=-134.2,y=56.7}, {x=-136.5,y=100.9},
	{x=-141.1,y=112.8}, {x=-139.7,y=132.1}, {x=-134.7,y=136},
	{}
    },
    -- どこから？ジュノ？。
    maw = {
	{x=270.1,y=-73.3,z=-7.9,desc="Cavernous Maw (禁断の口)"},
	{wait=2}, {target="Cavernous Maw"},
	{a="touch"}, {wait=1}, {a="up"}, {a="enter"}
    },
    -- 本
    book2uleg = {
	{x=204,y=-204,z=-24.2,desc="本からウルグラン山脈"},
	{x=196,y=-206}, {a="mount"},
	{x=117,y=-79},
	-- ここから坂をのぼる
	{x=22,y=57,z=-16.2}, {x=20,y=92,z=-21.5},
	--
	{x=20.3,y=67.4,z=-17.9}, {x=22.8,y=108.7,z=-25.9},
	{x=14.9,y=137.3,z=-33.2}, {x=6.8,y=135.5,z=-34.8},
	{x=-7,y=69.1,z=-36.2}, {x=-24.5,y=60.4}, {x=-50.9,y=60.1},
	{x=-70,y=62.4}, {x=-85.9,y=59.2}, {x=-98.4,y=60.1},
	{x=-130.7,y=51.5}, {x=-134.2,y=56.7}, {x=-136.5,y=100.9},
	{x=-141.1,y=112.8}, {x=-139.7,y=132.1}, {x=-134.7,y=136},
	{}
    },
    garuda = {
	{x=204,y=-204,z=-24.2,"空の王の小像(サンドリアM)"},
	{x=197,y=-207}, {a="mount"}, {x=192,y=-201}, {x=196,y=-114},
	{x=202,y=-29}, {x=204,y=11}, {x=220,y=71},
	{x=220,y=92,z=-13.5}, {x=217,y=108,z=-17.8}, {x=217,y=129,z=-21.6},
	{x=208,y=140,z=-26.8}, {x=199,y=127,z=-27.8},
	{x=197,y=113,z=-27.8}, {a="dismount"}, {x=181,y=85,z=-32.8},
	{target="???"}, {a="touch"},
	---
	--{x=210,y=138},
    },
    -- UnityWarp
    trail = {
	{x=576.2,y=-264.8,z=0,desc="Trail Markings"},
	{x=574,y=-271,z=-0.8},
	{target="Trail Markings"}, {a="touch"}
    },
    hero = {
	{x=576.2,y=-264.8,z=0,desc="Heroes' Gambit"},
	{x=564,y=-284,z=0,d=1},
	{target="Heroes' Gambit"}, {a="touch"}
    },
    hero2trail = {
	{x=564,y=-284,z=0,"デュミナス・ザルカバード"},
	{x=570,y=-275,z=-0.5,d=1},
    },
}

M.essential_points = {
    from_jueno = {x=270.1,y=-73.3,z=-7.9}, -- 別のzoneと間違えてない？
    book = {x=204,y=-204,z=-24.2},
    unity_warp = {x=576.2,y=-264.8,z=0},
}

M.automatic_routes = {
    from_jueno = { route="maw"},
    book = { route="garuda", contents="mission" },
    unity_warp = { route="trail" },
}

return M
