-- 東アルテパ砂漠

local M = { id = 114 }

M.routes = {
    -- 本ワープから
    ['h-10'] = {
	{x=-259,y=-265,z=8.5,desc="H-10 (サンドリアM)"},
	{x=-227,y=-242}, {a="mount"}, {x=-183,y=-239},
	{x=-129,y=-249}, {x=-30,y=-205}, {x=-22,y=-205,z=0.9},
	{x=-20,y=-213,z=2.5}, {x=-17,y=-249,z=11.9}, {x=-11,y=-256},
	{x=16,y=-261}, {x=20,y=-265}, {x=20,y=-274},
	{x=20.4,y=-321.5,z=18.1}, {}
    }
}

M.essentialPoints = {
    book = {x=-259,y=-265,z=8.5},
}

M.automatic_routes = {
    book = { route="h-10", contents="mission" },
}

return M
