-- クフィム島

local M = { id = 126 }

M.routes = {
    -- HP#1
    esca = {
	{x=-212,y=94,z=-21}, {x=-204,y=83.5},
	{x=-204.3,y=78.5,z=-20}, {w="3"}, {a="esc"}
    },
    pec = { --　珍妙なモンスター
	{x=-212,y=94,z=-21}, {x=-204,y=83.5},
	{x=-191.7,y=47.4}
    },
    pond = { -- 中央の池
	{x=-212,y=94,z=-21}, {x=-142,y=24},
	{x=-70,y=16}, {x=-61,y=17}, {x=-56,y=62},
	{x=-36,y=83}, {x=-10,y=85},
	-- {x=-4.5,y=99}, {x=-18,y=104},
    },
    hiero = { --デュミナス
	{r="pond"}, {x=7,y=117}, {x=19,y=148},
	{x=16,y=159}, {a="f8touch"}
    }
}

M.essentialPoints = {
    hp_1 = {x=-212,y=94,z=-21},
}

M.automatic_routes = {
    hp_1 = { route="esca" },
}
    
return M
