-- ゲルスバ野営陣

local M = { id = 140 }

M.routes = {
    common = {
	{x=100,y=-38,z=0.2,desc="入り口から少し移動"}, {x=98,y=4},
	{x=91,y=13}, {x=66,y=29}, {x=53,y=52}, {x=35,y=60},
    },
    hut = {
	{x=100,y=-38,z=0.2,desc="Hut Door(低レベルBC)"}, {x=98,y=4},
	{x=91,y=13}, {x=66,y=29}, {x=53,y=52}, {x=35,y=60},
	-- 共通
	{x=-25,y=94}, {x=-51,y=100},
	{x=-62,y=98}, {x=-84,y=100}, {x=-125,y=78}, {x=-148,y=75},
	{x=-157,y=79}, {x=-162.6,y=78.2,z=-11.7},
	{target="Hut Door"}, {a="touch"}
    },
    yug = {
	{x=100,y=-38,z=0.2,desc="ユグホト入り口(南西部)"},
	{x=98,y=4}, {x=91,y=13}, {x=66,y=29},
	{x=53,y=52}, {x=35,y=60},
	-- 共通
	{x=8,y=33}, {x=6,y=22}, {x=27,y=-14}, {x=55,y=-28},
	{x=59,y=-44}, {x=50,y=-56}, {x=15,y=-60},
	{x=-2,y=-61.1,z=0.1}, {}
    },
    -- ゲルスバ砦から
    war = {
	{x=125.9,y=181.9,z=-19.8}, {x=113,y=180}, {x=75,y=180},
	{x=68,y=179}, {x=52,y=176}, {x=19,y=177}, {x=-6,y=178},
	{x=-14,y=185}, {x=-16,y=201}, {x=-18,y=210}, {x=-11,y=215},
	{x=-10,y=222}, {x=-34,y=238}, {x=-59,y=248}
	-- {target="Warchief Vatgit"}
    },
}

M.essential_points = {
    entrance = {x=100,y=-38,z=0.2},
    from_fort = {x=125.9,y=181.9,z=-19.8},
}

M.automatic_routes = {
    entrance = { route="common" },
    from_fort = { route="war" },
}

return M
