-- ゲルスバ野営陣

local M = { id = 140 }

M.routes = {
    hut = {  -- 低レベル BC
	{x=100,y=-38,z=0.2},{x=98,y=4}, {x=91,y=13}, {x=66,y=29},
	{x=53,y=52}, {x=35,y=60},
	-- 共通
	{x=-25,y=94}, {x=-51,y=100},
	{x=-62,y=98}, {x=-84,y=100}, {x=-125,y=78}, {x=-148,y=75},
	{x=-157,y=79}, {x=-162.6,y=78.2,z=-11.7},
	{target="Hut Door"}, {a="touch"}
    },
    yug = {  -- 手前のユグホト
	{x=100,y=-38,z=0.2},{x=98,y=4}, {x=91,y=13}, {x=66,y=29},
	{x=53,y=52}, {x=35,y=60},
	-- 共通
	{x=8,y=33}, {x=6,y=22}, {x=27,y=-14}, {x=55,y=-28},
	{x=59,y=-44}, {x=50,y=-56}, {x=15,y=-60},
	{x=-2,y=-61.1,z=0.1}, {}
    },
}

M.essentialPoints = {
    entrance = {},
}

M.automatic_routes = {
    from_jueno = { route="vw" },
}

return M
