-- ダングルフの涸れ谷

local M = { id = 191 }

M.routes = {
    color = {
	{x=-23,y=0,z=-0.3,desc="カラーテスターの間欠泉(バストゥークM)"},
	{x=-26,y=-16}, {x=-36,y=-20}, {x=-45,y=-22},
	{x=-54,y=-26}, {x=-59,y=-19}, {x=-62,y=-10},
	{x=-60,y=8}, {x=-62,y=15}, {x=-71,y=21},
	{x=-87,y=20}, {x=-92,y=21}, {x=-98,y=25}, {x=-99,y=29},
	{x=-99,y=49}, {x=-105,y=58}, {x=-124,y=64},
	{x=-137,y=74}, {x=-143,y=91}, {x=-143,y=98},
	{x=-134,y=114}, {x=-133.5,y=133.5,z=2.7}
    },
}
M.essential_points = {
    book = {x=-23,y=0,z=-0.3},
}

M.automatic_routes = {
}

return M
