-- シャクラミの地下迷宮

local M = { id = 197 }

M.routes = {
    north = {
	{x=-339,y=-179,z=-12.2,desc="アットワ or Fossil Rock(ウィンダスM)"},
	{x=-341,y=-166}, {x=-338,y=-154}, {x=-331,y=-145},
	-- 共通
	{x=-303,y=-136}, {x=-265,y=-103}, {x=-224,y=-58},
	{x=-216,y=-23}, {x=-208,y=-11},
	-- 広場
	{x=-198,y=-3}, {x=-161,y=12}, {x=-135,y=4},
	-- 小さい坂を登る
	{x=-74,y=8}, {x=-58,y=9}, {x=-42,y=21},
	-- 小さい坂を降る
	{x=-36,y=27}, {x=-34,y=38},
    },
}

M.essential_points = {
    book = {x=-339,y=-179,z=-12.2},
}

M.automatic_routes = {
    book = { route="north" },  -- とりあえず北へ
}

return M
