-- フェ・イン

local M = { id = 204 }

M.routes = {
    bc = {
	{x=242,y=62,z=-24.4}, {x=244,y=61,z=-24.4}, {}
	-- {x=242.1,y=60.8,z=-24.2},
    },
    ruku = {
	{x=102.3,y=269.4,z=0,desc="Rukususu(ウィンダスM 8-2)"},
	{x=100,y=254}, {faith="balance"},
	{x=97,y=227}, {x=92,y=223}, {x=67,y=223}, {x=63,y=227},
	{x=58,y=264}, {x=29,y=295}, {x=7,y=307},
	{x=-9,y=311}, {x=-14,y=311}, {x=-26,y=287},
	{x=-30,y=272}, {x=-30,y=267}, {x=-9,y=254},
	-- ここから広場
	{x=-17,y=229},
	{x=-33,y=216}, {x=-40,y=213},
	{x=-92,y=210},
	-- ここまで広場
	{x=-97,y=216}, {x=-103,y=251}, {x=-106,y=256}, {x=-112,y=257},
	{x=-143,y=258}, {x=-151,y=253},
	{x=-175,y=229}, {x=-178,y=223},
	{x=-182,y=192}, {touch="Cermet Door"}
    },
}

M.essential_points = {
    hp1 = {x=242,y=62,z=-24.4},
    hp2 = {x=102.3,y=269.4,z=0},
}

M.automatic_routes = {
    hp1 = { route="bc", contents="mission" },
    hp2 = { route="ruku", contents="mission" },
}

return M
