-- 流砂洞

local M = { id = 208 }

M.routes = {
    -- 西アルテパ D-5 から
    altar = {
	-- x=-381.6,y={859.2-860},z=-0.1}
	{x=-381.6,y=860,z=-0.1,desc="南西(H-8)の祭壇"},
	{x=-375,y=860}, {faith="balance"}, {a="sneak"},
	{x=-345,y=858}, {x=-342,y=856},
	{x=-346,y=748}, {x=-348,y=746},
	-- {x=-410,y=740},
	{x=-420,y=740}, {w=5}, {x=-420,y=733}, {x=-420,y=727},
	{x=-418,y=715},
	{x=-410,y=705}, {target="Sandstone Door"}, {a="opendoor"},
	{x=-410,y=700},
	{x=-400,y=672}, {w=5}, {x=-410,y=661}, {x=-410,y=655},
	{x=-416,y=647}, {x=-418,y=642}, {x=-422,y=624}, {x=-424,y=623},
	{x=-449,y=620}, {target="Sandstone Door"}, {a="opendoor"},
	{x=-455,y=620}, {x=-467,y=620,z=0},
	{target="???"}, {a="touch"}, {auto=true}
    },
    -- 西アルテパ D-12 から
    ent = {
	{x=-738.9,y=-521.8,z=-16,desc="重量扉まで？"},
	{x=-742,y=-576,z=-4}, {faith="balance"}, {a="sneak"},
	{x=-744,y=-578}, {x=-776,y=-578}, {x=-778,y=-576},
	{x=-780,y=-460,z=-0.4}, {auto=true}
    },
    -- 東アルテパ H-10 から
    kings = {
	{x=700,y=-688.2,z=-24,"王者の泉(Fountain of Kings) サンドリアM"},
	{x=699,y=-736}, {x=696,y=-738}, {x=579,y=-741},
	{x=464,y=-745,z=-16}, {x=461,y=-748,z=-15.9},
	{x=462,y=-768,z=-14.7}, {x=466,y=-781,z=-14.7},
	{x=476,y=-796,z=-13.9}, {x=487,y=-807,z=-13.9},
	{x=493,y=-814,z=-9.9}, {x=496.5,y=-815.6,z=-8.5},
	-- 穴から落ちる
	{x=497.5,y=-817.2}, -- z=5.8
	{x=499,y=-853,z=1.1}, {x=491,y=-859,z=1.1},
	--- 分岐
	{x=465,y=-865,z=1.3}, {x=461,y=-893,z=1.1},
	{x=468,y=-899,z=1}, {x=495,y=-904,z=4.8},
	{x=499,y=-912,z=8}, {x=501,y=-932,z=10.9},
	{x=508,y=-939,z=14.3}, {x=550,y=-940,z=17.9},
	{x=567,y=-939,z=18.2,d=1},
	{target="Fountain of Kings"}
    },
}

M.essentialPoints = {
    -- たまに反応しない ので、次 pos する
    ent_west_d12 = {x=-738.9,y=-521.8,z=-16},
    ent_east_h10 = {x=700,y=-688.2,z=-24},
}

M.automatic_routes = {
    --ent_west_d12 = { route="ent" },  -- 時間かかるので放置しかねないので
    ent_east_h10 = { route="kings" },
}

return M
