-- ウィンダス森の区

local M = { id = 241 }

M.routes = {
    -- HP#1
    peri = { -- ミスラ族長
	{x=10.1,y=0.6,z=-2.5},  {x=24,y=8}, {x=28,y=19},
	{x=26,y=36}, {x=17,y=47}, {x=17,y=56}, {x=26,y=66},
	{x=27,y=70},
	-- 分かれ道
	{x=29,y=89}, {x=31,y=91}, {x=41,y=93}, {x=50,y=99},
	{x=91,y=101}, {x=96,y=106}, {x=115,y=106}, {x=118,y=104},
	{x=117.5,y=92.6,d=0.5},
    },
    nana = { -- ナナミーゴ
	{x=10.1,y=0.6,z=-2.5},  {x=24,y=8}, {x=28,y=19},
	{x=26,y=36}, {x=17,y=47}, {x=17,y=56}, {x=26,y=66},
	{x=27,y=70},
	-- 分かれ道
	{x=29,y=108,d=1}, {x=35,y=116,d=1}, {x=38,y=162}, {x=41,y=163},
	{x=50,y=165}, {x=61,y=175},
	-- 分かれ道 (それると双子石のピアス)
	{x=61,y=184}, {x=59,y=211}, {x=54,y=217}, {x=54,y=236},
	{x=56,y=238}, {x=62.4,y=239.1,z=-4.8,d=1}, {a="f8touch"}
    },
    -- #2(E)
    rako = {
	{x=108,y=-56,z=-5,desc="Rakoh Buuma(ガード)"},
	{x=105,y=-30}, {x=109,y=-25,z=-5},
	{target="Rakoh Buuma"}
    },
    -- #3(M)
    apu = {
	{x=-92,y=63,z=-5,desc="Apururu(手の院)"},
	{x=-81,y=38}, {x=-75,y=37}, {x=-61,y=44}, {x=-55,y=41},
	{x=-41,y=-5}, {x=-36,y=-7}, {x=-31,y=-4},
	{x=-25,y=10}, {target="Door:Manustery"}, {a="opendoor"},
	{x=-20,y=11}, {x=-14,y=15},
	{target="Apururu"}, {a="touch"}
    },
}

M.essential_points = {
    hp1 = {x=10.1,y=0.6,z=-2.5},
    hp2E = {x=108,y=-56,z=-5},
    hp3M = {x=-92,y=63,z=-5},
}

M.automatic_routes = {
    -- hp1 = { route="nana" },
    hp2E = { route="rako", contents="mission" },
    hp3M = { route="apu", contents="mission" },
}

return M
