-- ジュノ上層

local M = { id = 244 }

M.routes = {
    -- HP (E)
    marble = {
	{x=-100,y=167.6,z=0,desc="限定酒場マーブルブリッジ"},
	{x=-68.3,y=110.9}, {x=-72.1,y=105.8}, {x=-95.9,y=92},
	{a="f8touch"}
    },
    -- HP (A)
    choco = {
	{x=-52,y=15,z=1,desc="チョコボ厩舎"},
	{x=-48.6,y=34.9}, {x=-58,y=75.8}, {x=-42.1,y=87},
	{x=-48,y=96.4}, {x=-49.7,y=95.5,z=8.2}
    },
    mon = {
	{x=-52,y=15,z=1,desc="医者モンブロー"},
	{x=-60,y=15}, {x=-63,y=11},
	{x=-60,y=6.5}, {a="opendoor"}, {x=-57,y=3}, {x=-50,y=3},
	{x=-45,y=0,z=-0.5}, {target="Monberaux"}, {a="touch"},
    },
}

return M
