-- ジュノ下層

local M = { id = 245 }

M.routes = {
    -- HP (M)
    tensho = {-- {x=19,y=-53}, {x=17.2,y=31.7},  -- 天晶堂
	--{x=10.3,y=25.1}, {x=6,y=18.1}, {x=4,y=8.2},
	--{x=12.6,y=-1.5}, {a="f8touch"}, {x=35.9,y=-15.4},
	--{a="f8touch"}
	{x=19,y=53,z=-1}, {x=17,y=46}, {x=19,y=33},
	{x=15,y=28}, {x=11,y=26}, {x=5,y=17}, {x=4,y=8},
	{x=12.5,y=-1}, {a="f8touch"}, {x=15,y=-3.3},
	{x=36,y=-15.5}, {a="f8touch"},
    },
    -- HP (E)
    gob = { {x=-99.6,y=-183.4}, {x=-93.8,y=-150.4},
	{x=-68.7,y=-102.6},{x=-51.2,y=-113.2}
    },
    grey = { -- grayson (A.M.A.N.トローブ)
	{x=-99.6,y=-183.4,z=0}, {x=-97,y=-173,d=0.5},
	{x=-93.4,y=-168,z=0,d=0.5}, {a="f8touch"}
    },
    nantoto = { -- エミネンスのタル娘
	{x=-99.6,y=-183.4,z=0}, {x=-95,y=-156},
	{x=-59,y=-90,z=6,d=1},
	{x=-39,y=-49,z=0}, {x=-41,y=-47,z=0},
	{x=-42.7,y=-48.5,z=0}, {a="f8touch"}
    },
}

M.essentialPoints = {
    hp1 = {x=-99.6,y=-183.4,z=0}
}

M.automatic_routes = {
    hp1 = { route="grey" },
}

return M
