-- ドーの門

local M = { id = 272 }

M.routes = {
    -- マリアミから
    rocky = {
	{x=-320.5,y=340.4,z=-40}, {x=-299,y=337}, {a="insne"},
	{x=-287,y=325}, {x=-294,y=306},	{x=-314,y=300},
	{x=-328,y=300}, {x=-338,y=290}, {x=-340,y=268}, {x=-330,y=250},
	--- 広場に出る
	{x=-323,y=235}, {x=-318,y=218},
	-- 狭いとこに入る
	{x=-302,y=210}, {x=-292,y=211}, {x=-291,y=217,d=1},
	{target="Rocky Outcrop"}, {a="touch"}
    },
    -- エヌティエル水林から
    common = {
	{x=59.3,y=80,z=-10,"XXX"}, {x=54,y=66}, -- {a="insne"},
	{x=33,y=62}, {x=20,y=79}, {x=16,y=98}, {x=-13,y=100},
    },
    raive1 = {
	{x=59.3,y=80,z=-10,"XXX"}, {x=54,y=66}, -- {a="insne"},
	{x=33,y=62}, {x=20,y=79}, {x=16,y=98}, {x=-13,y=100},
	---
	{x=-31,y=110}, {x=-66,y=108}, {x=-70,y=94}, {x=-62,y=83},
	{enemy_filter="Knotted Root"}, {target="Knotted Root"},
	{auto=true}
    },
    iniet = {
	{x=59.3,y=80,z=-10,"Iniet of Whispers(イドリスクエ)"},
	{x=54,y=66}, -- {a="insne"},
	{x=33,y=62}, {x=20,y=79}, {x=16,y=98}, {x=-13,y=100},
	---
	{x=-31,y=110}, {x=-66,y=108}, {x=-70,y=94}, {x=-62,y=83},
	---
	{x=-63,y=61}, {x=-87,y=60}, {x=-95,y=49},
	{x=-109,y=20}, {x=-137,y=18}, {x=-142,y=-19}, {x=-151,y=-21},
	{x=-185,y=-14}, {x=-218,y=15}, {x=-243,y=19}, {x=-252,y=12},
	{x=-271,y=-18}, {x=-296,y=-22}, {x=-300,y=-38}, {x=-305,y=-63},
	{x=-307,y=-97}, {target="Iniet of Whispers"}, {a="touch"}
    },
    whis = {
	{x=59.3,y=80,z=-10,"Water of Whispers(イドリスクエ)"},
	{x=54,y=66}, -- {a="insne"},
	{x=33,y=62}, {x=20,y=79}, {x=16,y=98}, {x=-13,y=100},
	--
	{x=-31,y=110}, {x=-73,y=127}, {x=-92,y=134}, {x=-100,y=153},
	{x=-107,y=178}, {x=-147,y=187}, {x=-179,y=228},
	{x=-186,y=263}, {x=-202,y=270}, {x=-224,y=258,d=1},
	{target="Water of Whispers"},
    },
}

M.essentialPoints = {
    from_hennetiel = {x=59.3,y=80,z=-10},
    from_marjami = {x=-320.5,y=340.4,z=-40},
}

M.automatic_routes = {
    from_hennetiel = { route="common" },  -- 危なく無い場所まで
    -- from_marjami = { route="rocky" },  -- 危ないので一旦無効化
}

return M
