-- アルザビ

local M = { id = 48 }

M.routes = {
    -- モグハウスから
    waja = {
	{x=39.3,y=-62.5,z=0,desc="ワジャーム(wajaom)への出口(西)"},
	{x=30,y=-51,d=1}, {x=17,y=-40,d=1},
	{x=-16,y=-40,d=1}, {x=-40,y=-17,d=1}, {x=-40,y=17,d=1},
	-- ここまで共通
	{x=-56,y=40,d=1}, {x=-74,y=40,d=1},
	{x=-108,y=68,d=1}, {x=-115,y=68, z=2}, {}
    },
    bha = {
	{x=39.3,y=-62.5,z=0,desc="バフラウ(bhaflau)への出口(北)"},
	{x=30,y=-51,d=1}, {x=17,y=-40,d=1},
	{x=-16,y=-40,d=1}, {x=-40,y=-17,d=1}, {x=-40,y=17,d=1},
	-- ここまで共通
	{x=-40,y=58}, {x=-40,y=73}, {x=-67,y=108},
	{x=-67.2,y=118.2,z=2}, {}
    },
}

return M
