-- アラパゴ暗礁域
local M = { id = 54 }

M.routes = {
    -- 本ワープ
    ['door-fang'] = {
	{x=476,y=-20,z=-15.6,desc="Door (ラミアの牙のカギ)"},
	{x=474,y=-24}, {x=470,y=-27}, {faith="balance"},
	{x=465,y=-25}, {x=460,y=1}, {x=459,y=25,z=-15.2},
	{x=463,y=30,z=-14.6}, {x=465,y=38,z=-10.8},
	{x=460,y=43,z=-10.1}, {x=449,y=42,z=-10.3},
	-- 船に入る
	{x=448,y=51,z=-10.2}, {x=451,y=56,z=-10},
	{x=450,y=62,z=-10}, {x=456,y=69,z=-7},
	{x=460,y=69,z=-7}, {x=464,y=65,z=-7.2},
	--- 船を降りる
	{x=476,y=58,z=-7.1}, {x=483,y=50,z=-3.8},
	{x=493,y=49}, {x=506,y=54}, {x=523,y=56}, {x=537,y=76},
	{x=540,y=84}, {x=546,y=99,z=-8.1}, {x=580,y=96,z=-11.6},
	{x=587,y=98,z=-12.7}, {x=587,y=107,z=-15},
	{x=580,y=118,z=-15.9}, {auto=true}
    },
    corseia = {
	{x=580,y=125,z=-15.6,desc="ラミア牙door から [H10] コルセア取得の船"},
	{x=576,y=137}, {x=544,y=142}, {x=527,y=140,d=1},
	{target="Iron Gate"}, {a="opendoor"}, {x=517,y=140,z=-15.5},
	{x=489,y=139}, {x=481,y=139}, {x=477,y=135}, {x=478,y=125},
	{x=472,y=115},
    },
    -- カダーバ沼から
    guide = {
	{x=-560,y=380,z=-7.6,desc="Apukallu Guide (長老ペンギン)"},
	{x=-537,y=383}, {faith="balance"}, {x=-533,y=377},
	{x=-538,y=368}, {x=-543,y=351}, {x=-546,y=344}, {x=-543,y=338},
	{x=-510,y=338}, {x=-501,y=328}, {x=-501,y=305},
	{x=-506,y=301}, {x=-520,y=300}, {x=-542,y=285,d=1},
	{target="Apkallu Guide"}, {a="touch"}
    },
    -- H6 入り口
    cutter = {
	{x=-419.6,y=-280,z=-7.7, desc="Cutter(BC入り口)"},
	{x=-416,y=-302}, {x=-424,y=-306},
	{x=-432,y=-301}, {x=-447,y=-299}, {x=-457,y=-293},
	{x=-462,y=-297}, {x=-460,y=-328},
	-- 洞窟を抜けた先。なるべくエンカウントないよう壁沿い
	{x=-448,y=-333}, {x=-434,y=-333}, {x=-417,y=-344},
	{x=-412,y=-353}, {x=-416,y=-370}, {x=-421,y=-380},
	{x=-422,y=-403}, {x=-433,y=-414}, {x=-454,y=-413},
	{x=-456,y=-411,z=-3}, {x=-456.5,y=-406.7,z=-3},
    },
}
M.essentialPoints = {
    book = {x=476,y=-20,z=-15.6},
    h6_entrance = {x=-419.6,y=-280,z=-7.7},
    from_Caedarva = {x=-560,y=380,z=-7.6},
}

M.automatic_routes = {
    book = { route='door-fang' },
    from_Caedarva = { route="guide" },
}

M.essentialItems = {
    2219,  -- ラミアの牙のカギ
}

M.essentialKeyItems = { }

return M
