-- アラパゴ暗礁域
local M = { id = 54 }

M.routes = {
    -- H6 入り口
    cutter = {
	{x=-419.6,y=-280,z=-7.7}, {x=-416,y=-302}, {x=-424,y=-306},
	{x=-432,y=-301}, {x=-447,y=-299}, {x=-457,y=-293},
	{x=-462,y=-297}, {x=-460,y=-328},
	-- 洞窟を抜けた先。なるべくエンカウントないよう壁沿い
	{x=-448,y=-333}, {x=-434,y=-333}, {x=-417,y=-344},
	{x=-412,y=-353}, {x=-416,y=-370}, {x=-421,y=-380},
	{x=-422,y=-403}, {x=-433,y=-414}, {x=-454,y=-413},
	{x=-456,y=-411,z=-3}, {x=-456.5,y=-406.7,z=-3},
    },
}
M.essentialPoints = {
    h6_entrance = {x=-419.6,y=-280,z=-7.7}
}

M.automatic_routes = {
}

return M
