-- ハルブーン

local M = { id = 62 }

M.routes = {
    -- 北西(左上))スタート
    east = {
	{x=-540,y=400.5,z=-40}, {x=-535,y=412}, {x=-520, y=420},
	{a="invisi"}, {x=-507,y=414}, {x=-494,y=390}, {x=-491,y=387},
	{x=-479,y=391}, {x=-475,y=393}, {x=-472,y=398},
	{x=-476,y=416}, {x=-473,y=419}, {x=-461,y=420},
	{x=-452,y=418}, {x=-432,y=417}, {x=-420,y=401},
	{x=-415,y=389}, {x=-412,y=386.7,z=-35.4}, {}
	
    }
}

M.essentialPoints = {
    northwest = {x=-540,y=400.5,z=-40},
    northeast = {x=-412,y=386.7,z=-35.4},
}
M.automatic_routes = {
    northwest = { route="east" },
}

return M
