-- ソロムグ原野〔Ｓ〕

local M = { id = 98 }

M.routes = {
    --ロランベリーから
    rolan2jueno = {
	{}, {x=-454.8,y=207.2,z=-0}, {x=-413.5,y=224,z=-0},
	{x=-405,y=291.8,z=0.2}, {x=-442.6,y=339.1,z=1}
    },
    -- 本
    book2jueno = {
	{x=476,y=-438,z=-8}, {x=479,y=-434}, {x=479,y=-407}, {a="mount"},
	{x=462,y=-358},	{x=470,y=-277},	{x=468,y=-260}, {x=405,y=-151},
	{x=390,y=57}, {x=341,y=99}, {x=296,y=138}, {x=231,y=160},
	{x=136,y=163}, {x=40,y=180}, {x=-5,y=131}, {x=-41,y=112},
	-- 左の骨のとこ
	{x=-145,y=113}, {x=-178,y=144}, {x=-214,y=184}, {x=-271,y=227},
	{x=-341,y=328}, {x=-360,y=334}, {x=-432,y=342}, {a="dismount"},
	{x=-443.1,y=342.3,z=0.9}, {a="opendoor"}
    },
}

M.essentialPoints = {
    book = {x=476,y=-438,z=-8},
}


M.automatic_routes = {
    book = { route="book2jueno" },
}

return M

