-- データ
local M = {}

-- https://wiki.ffo.jp/html/38412.html
M.next_exemplar_table = {
    [0] = 2500, [1] = 5550, [2] = 8721, [3] = 11919, [4] = 15122,
    [5] = 18327, [6] = 21532, [7] = 24737, [8] = 27942, [9] = 31147,
    [10] = 41205, [11] = 48130, [12] = 53677, [13] = 58618, [14] = 63292,
    [15] = 67848, [16] = 72353, [17] = 76835, [18] = 81307, [19] = 85775,
    [20] = 109112, [21] = 127014, [22] = 141329, [23] = 153277, [24] = 163663,
    [25] = 173018, [26] = 181692, [27] = 189917, [28] = 197845, [29] = 205578,
    [30] = 258409, [31] = 307400, [32] = 353012, [33] = 395651, [34] = 435673,
    [35] = 473392, [36] = 509085, [37] = 542995, [38] = 575336, [39] = 606296,
    [40] = 769426, [41] = 951369, [42] = 1154006, [43] = 1379407,
    [44] = 1629848, [45] = 1907833, [46] = 2216116, [47] = 2557728,
    [48] = 2936001, [49] = 3354601, [50] = 3817561
}

-- https://wiki.ffo.jp/html/3347.html
M.phantom_roll_table = {
    ["コルセアズロール"] = {job="COR", lucky=5, unlucky=9},
    ["ニンジャロール"]   = {job="NIN", lucky=4, unlucky=8},
    ["ハンターズロール"] = {job="RNG", lucky=4, unlucky=8},
    ["カオスロール"]     = {job="DRK", lucky=4, unlucky=8},
    ["メガスズロール"]   = {job="BLU", lucky=2, unlucky=6},
    -- ["ヒーラーズロール"] = {job="", lucky=, unlucky=},
    -- ["ドラケンロール"] = {job="", lucky=, unlucky=},
    -- ["コーラルロール"] = {job="", lucky=, unlucky=},
    -- ["モンクスロール"] = {job="", lucky=, unlucky=},
    -- ["ビーストロール"] = {job="", lucky=, unlucky=},
    ["サムライロール"] = {job="SAM", lucky=2, unlucky=6},
    ["エボカーズロール"] = {job="SMN", lucky=5, unlucky=9},
    -- ["ローグズロール"] = {job="", lucky=, unlucky=},
    ["ワーロックスロール"] = {job="RDM", lucky=4, unlucky=8},
    ["ファイターズロール"] = {job="WAR", lucky=5, unlucky=9},
    -- ["パペットロール"] = {job="", lucky=, unlucky=},
    ["ガランツロール"] = {job="PLD", lucky=3, unlucky=7},
    ["ウィザーズロール"] = {job="BLM", lucky=5, unlucky=9},
    ["ダンサーロール"] = {job="DNC", lucky=3, unlucky=7},
    -- ["スカラーロール"] = {job="", lucky=, unlucky=},
    -- ["ナチュラリストロール"] = {job="", lucky=, unlucky=},
    -- ["ルーニストロール"] = {job="", lucky=, unlucky=},
    -- ["ボルターズロール"] = {job="", lucky=, unlucky=},
    -- ["キャスターズロール"] = {job="", lucky=, unlucky=},
    -- ["コアサーズロール"] = {job="", lucky=, unlucky=},
    ["ブリッツァロール"] = {job=nil, lucky=4, unlucky=9},
    -- ["タクティックロール"] = {job="", lucky=, unlucky=},
    -- ["アライズロール"] = {job="", lucky=, unlucky=},
    -- ["マイザーロール"] = {job="", lucky=, unlucky=},
    -- ["コンパニオンロール"] = {job="", lucky=, unlucky=},
    -- ["カウンターロール"] = {job="", lucky=, unlucky=},
}

return M
