local M = {}

M.drop_items = {
    18826, -- アンブラストラップ
    --
    20605, -- オーディアム
    20610, -- ラダマントゥス
    20715, -- アクリメーター
    20756, -- ソウルクリーバー
    20855, -- デヴィヴィファイア
    20900, -- ミークカラーサイズ
    20986, -- アチウチカプ
    --
    21221, -- ブラマストラ
    21345, -- フォーカルオーブ
    --
    26721, -- ラビッドバイザー
    26790, -- ビファウルクラウン
    26874, -- スペイウエスキット
    26944, -- タルタロスプレート
    26945, -- カウントガーブ
    --
    27044, -- クラッシュガントレ
    27096, -- カウントカフス
    27221, -- アバタラスロップス
    27222, -- リンボトラウザ
    27223, -- フィーストホーズ
    27507, -- デビアントネクラス
    27506, -- テファイアンカラー
    27592, -- ヴェンジフルリング
    --
    28323, -- パンチネロ
    28418, -- インカーネトサッシュ
    28421, -- ルミネートサッシュ
    28422, -- ファーミンサッシュ
    28478, -- エテオレートピアス
    28483, -- クリプティクピアス
}

return M
